Creat Data Frames

In [1]:
import pandas as pd
import numpy as np

In [6]:
population_dict={'bghdad':789456,
                'tunis':654987,
                ' rlgeria':456789,
                'riyadh':859674,
                'cairo':748596}
population=pd.Series(population_dict)
area_dict={'bghdad':204,'tunis':212,' rlgeria':1190,'riyadh':1973,'cairo':3085}
area=pd.Series(area_dict)
           
area

bghdad       204
tunis        212
 rlgeria    1190
riyadh      1973
cairo       3085
dtype: int64

In [16]:
data=pd.DataFrame({'population':population,
              'area':area})
data

          population  area
bghdad        789456   204
tunis         654987   212
 rlgeria      456789  1190
riyadh        859674  1973
cairo         748596  3085

From python dictinaries

In [ ]:
pd.DataFrame({'population':[789456,654987,456789,859674,748596],'area':[204,212.1190,1973,3085]},index=['bghdad','tunis','rlgeria','riyadh','cairo'])

In [18]:
data.index

Index(['bghdad', 'tunis', ' rlgeria', 'riyadh', 'cairo'], dtype='object')

In [21]:
data.columns

Index(['population', 'area'], dtype='object')

get the erea column

In [22]:
data['area']

bghdad       204
tunis        212
 rlgeria    1190
riyadh      1973
cairo       3085
Name: area, dtype: int64

In [23]:
data['area']['cairo']

3085

From a single series object

In [24]:
pd.DataFrame(area,columns =['area'])

          area
bghdad     204
tunis      212
 rlgeria  1190
riyadh    1973
cairo     3085

In [25]:
pd.DataFrame({'area':area})

          area
bghdad     204
tunis      212
 rlgeria  1190
riyadh    1973
cairo     3085

From a list dictionaries

In [26]:
data=[{'a':0,'b':0},
     {'a':1,'b':1},
     {'a':2,'b':2}]
data

[{'a': 0, 'b': 0}, {'a': 1, 'b': 1}, {'a': 2, 'b': 2}]

In [27]:
pd.DataFrame(data)

   a  b
0  0  0
1  1  1
2  2  2

anather way creat a list dictionaries

In [30]:
data= [{'a':i,"b":2*i}
      for i in range (3)]
data

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]

In [31]:
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

From a tow dimensional numpy array

In [32]:
arr=np.random.randint(1,20,30).reshape(10,3)
arr

array([[13,  1,  6],
       [ 5,  9,  1],
       [ 2,  3,  7],
       [10, 14,  6],
       [18,  6,  3],
       [ 8,  2,  9],
       [12,  2,  5],
       [15,  6,  7],
       [ 9,  2, 10],
       [ 2, 10,  2]])

In [33]:
pd.DataFrame(arr)

    0   1   2
0  13   1   6
1   5   9   1
2   2   3   7
3  10  14   6
4  18   6   3
5   8   2   9
6  12   2   5
7  15   6   7
8   9   2  10
9   2  10   2

In [34]:
pd.DataFrame(arr,columns =['age','length','width'])

   age  length  width
0   13       1      6
1    5       9      1
2    2       3      7
3   10      14      6
4   18       6      3
5    8       2      9
6   12       2      5
7   15       6      7
8    9       2     10
9    2      10      2

In [35]:
pd.DataFrame(arr,columns =['age','length','width'],index=['i','a','b','c','d','e','f','g','h','k'])

   age  length  width
i   13       1      6
a    5       9      1
b    2       3      7
c   10      14      6
d   18       6      3
e    8       2      9
f   12       2      5
g   15       6      7
h    9       2     10
k    2      10      2